Тестовая_база_ERP_14/src/InformationRegisters/CRM_ЖурналДокументов/CRM_ЖурналДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЖурналДокументов</name>
  <resources>
    <name>ТипОбъекта</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>ВходящееИсходящее</name>
    <type>
      <types>EnumRef.CRM_ВходящееИсходящееСобытие</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСобытия</name>
    <type>
      <types>CatalogRef.CRM_СостоянияСобытий</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеИнтереса</name>
    <comment>Состояние интереса</comment>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьПрисоединенныеФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойИнтерес</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтересЯвляетсяОснованием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ГлавнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>Characteristic.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CRM_Интерес</name>
    <comment>Интерес</comment>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/CRM_УчетныеЗаписиМессенджеров/CRM_УчетныеЗаписиМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_УчетныеЗаписиМессенджеров</name>
  <resources>
    <name>Администрирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Запись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Основная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/ИсполнителиЗадач/ИсполнителиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсполнителиЗадач</name>
  <attributes>
    <name>ГруппаИсполнителейЗадач</name>
    <type>
      <types>CatalogRef.ГруппыИсполнителейЗадач</types>
    </type>
  </attributes>
  <dimensions>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/CRM_СобытияМессенджеров/CRM_СобытияМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СобытияМессенджеров</name>
  <attributes>
    <name>Значение</name>
    <type>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.CRM_СобытияМессенджеров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID_Пользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/CRM_ВидыСообщенияМессенджера/CRM_ВидыСообщенияМессенджера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыСообщенияМессенджера</name>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/CRM_СобытияМессенджеров/CRM_СобытияМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СобытияМессенджеров</name>
  <enumValues>
    <name>ПолученоНовоеСообщение</name>
  </enumValues>
  <enumValues>
    <name>ПрочитаныСообщения</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/CRM_СообщениеМессенджера/CRM_СообщениеМессенджера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_СообщениеМессенджера</name>
  <posting>Deny</posting>
  <attributes>
    <name>ID_Пользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID_Сообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.CRM_ВидыСообщенияМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
</mdclass:Document>

Тестовая_база_ERP_14/src/Catalogs/CRM_УчетныеЗаписиМессенджеров/CRM_УчетныеЗаписиМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УчетныеЗаписиМессенджеров</name>
  <attributes>
    <name>УдалитьТокен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМессенджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьIDГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТокенГруппы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПросмотрСообщенийВсемПользователям</name>
    <comment>Разрешить просмотр сообщений всем пользователям, независимо от настройки доступа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаНачальнойЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметровДоступа</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/CommonModules/CRM_РаботаСМессенджерамиСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// CRM работа с мессенджерами сервер
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

#Область МетодыВзаимодействияСОбработкамиМессенджеров

// Отправить сообщение.
//
// Параметры:
//  ТекстСообщения	 - Строка - Текст сообщения.
//  УчетнаяЗапись	 - СправочникСсылка - Ссылка на учетную запись.
//  Группа			 - Строка - Текущая группа. 
//  IDПользователя	 - Строка - ИД пользователя. 
//  Контакт			 - СправочникСсылка	 - Ссылка на контакт.
//  СписокФайлов	 - СписокЗначений - Список файлов.
//  ДопПараметры	 - Структура - Дополнительные параметры.
// 
// Возвращаемое значение:
//  ДокументСсылка.CRM_СообщениеМессенджера - Ссылка на созданное сообщение.
//
Функция ОтправитьСообщение(ТекстСообщения, УчетнаяЗапись, Группа, IDПользователя, Контакт, СписокФайлов, ДопПараметры = Неопределено) Экспорт
	
	Сообщение = Документы.CRM_СообщениеМессенджера.СоздатьДокумент();
	Сообщение.Дата = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
	Сообщение.ТекстСообщения = СокрЛП(ТекстСообщения);
	Сообщение.ВидСообщения = Перечисления.CRM_ВидыСообщенияМессенджера.Исходящее;
	Сообщение.ID_Пользователя = IDПользователя;
	Если ТипЗнч(Контакт)<>Тип("Строка") Тогда
		Сообщение.Контакт = Контакт;
		Сообщение.КонтактПредставление = Строка(Контакт);
	Иначе
		Сообщение.КонтактПредставление = Контакт;
	КонецЕсли;
	Сообщение.Группа = Группа;
	Сообщение.УчетнаяЗапись = УчетнаяЗапись;
	Сообщение.Ответственный = Пользователи.ТекущийПользователь();
	МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(УчетнаяЗапись.ТипМессенджера);
	ID_Сообщения = МодульМенеджера.ОтправитьСообщение(Сообщение.ТекстСообщения, УчетнаяЗапись, IDПользователя, СписокФайлов, ДопПараметры);
	Если ID_Сообщения<> Неопределено Тогда 
		Сообщение.ID_Сообщения = ID_Сообщения;
		Сообщение.Записать();
		Если СписокФайлов<>Неопределено Тогда
			Для каждого Вложение из СписокФайлов Цикл
				ПараметрыФайла = Новый Структура;
				ПараметрыФайла.Вставить("ВладелецФайлов", Сообщение.Ссылка);
				ПараметрыФайла.Вставить("Автор", Пользователи.ТекущийПользователь());
				ПараметрыФайла.Вставить("ИмяБезРасширения", Лев(Вложение.Представление, СтрНайти(Вложение.Представление, ".")-1));
				ПараметрыФайла.Вставить("РасширениеБезТочки", Сред(Вложение.Представление, СтрНайти(Вложение.Представление, ".")+1));
				ПараметрыФайла.Вставить("ВремяИзменения", Неопределено);
				ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
				РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, Вложение.Значение);
			КонецЦикла;
		КонецЕсли;
		Возврат Сообщение.Ссылка;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

// Получить сообщения по учетной записи.
//
// Параметры:
//  УчетнаяЗапись	 - СправочникСсылка - Ссылка на учетную запись.
//
Процедура ПолучитьСообщенияУчетнойЗаписи(УчетнаяЗапись) Экспорт
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(УчетнаяЗапись.ТипМессенджера);
		МассивСообщений = МодульМенеджера.ПолучитьСообщения(УчетнаяЗапись);
		СоздатьСообщенияИзПолученныхДанных(УчетнаяЗапись, МассивСообщений);
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	CRM_УчетныеЗаписиМессенджеров.Ссылка КАК Ссылка,
		                      |	CRM_УчетныеЗаписиМессенджеров.ТипМессенджера КАК ТипМессенджера
		                      |ИЗ
		                      |	Справочник.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
		                      |ГДЕ
		                      |	НЕ CRM_УчетныеЗаписиМессенджеров.ПометкаУдаления");
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(Выборка.ТипМессенджера);
			МассивСообщений = МодульМенеджера.ПолучитьСообщения(Выборка.Ссылка);
			СоздатьСообщенияИзПолученныхДанных(Выборка.Ссылка, МассивСообщений);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Путь к диалогу в браузере
//
// Параметры:
//  Структура	 - Структура - Передаваемая  структура.
// 
// Возвращаемое значение:
//  Строка - Путь к диалогу.
//
Функция ПутьКДиалогуВБраузере(Структура) Экспорт
	МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(Структура.УчетнаяЗапись.ТипМессенджера);
	Возврат МодульМенеджера.ПутьКДиалогуВБраузере(Структура);
КонецФункции

#КонецОбласти

#Область ОбщиеПроцедурыИФункции

// Выполнить запрос к ресурсу.
//
// Параметры:
//  Сервер			 - Строка - Сервер.
//  СтрокаЗапроса	 - Строка - Строка запроса.
//  Ресурс			 - Строка - Ресурс. 
//  Прокси			 - Структура - Структура прокси.
// 
// Возвращаемое значение:
//  Строка - Текст ответа.
//
Функция ВыполнитьЗапрос(Сервер, СтрокаЗапроса = "", Ресурс, Прокси=Неопределено) Экспорт  
	
	Если Прокси<>Неопределено Тогда
		HTTPПрокси = Новый ИнтернетПрокси;	
		HTTPПрокси.Установить("https", Прокси.Сервер, Прокси.Порт, Прокси.Пользователь, Прокси.Пароль, Ложь); 
	Иначе
		HTTPПрокси = Неопределено;
	КонецЕсли;
	HTTP =  Новый HTTPСоединение(Сервер,,,,HTTPПрокси,,Новый ЗащищенноеСоединениеOpenSSL);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "Content-Type: application/json");
	HTTPЗапрос = Новый HTTPЗапрос(КодироватьСтроку(Ресурс, СпособКодированияСтроки.URLВКодировкеURL));
	Если ЗначениеЗаполнено(СтрокаЗапроса) Тогда
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса,"UTF-8",ИспользованиеByteOrderMark.НеИспользовать);
		Ответ = HTTP.ОтправитьДляОбработки(HTTPЗапрос);
	Иначе	
		Ответ = HTTP.Получить(HTTPЗапрос);
	КонецЕсли;
	
    ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	Возврат ТекстОтвета;
КонецФункции

// Получить значение из ответа JSON.
//
// Параметры:
//  ТекстJSON	 - Строка - Текст JSON. 
// 
// Возвращаемое значение:
//  Произвольный - Значение ответа.
//
Функция ПолучитьЗначениеИзОтветаJSON(ТекстJSON)Экспорт 
	ЧтениеJSON=Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	Значение=ПрочитатьJSON(ЧтениеJSON);
	Возврат Значение
КонецФункции

// Получить строку JSON
//
// Параметры:
//  Значение					 - Срока - Объект записи JSON.
//  ИспользоватьДвойныеКавычки	 - Булево - Определяет использование двойных кавычек при записи
//										свойств и значений JSON.
// 
// Возвращаемое значение:
//  Строка - Завершает запись текста JSON. 
//
Функция ПолучитьСтрокуJSON(Значение, ИспользоватьДвойныеКавычки = Ложь) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет,,ИспользоватьДвойныеКавычки));
	ЗаписатьJSON(ЗаписьJSON, Значение);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

// Не связанные сообщения контакта.
//
// Параметры:
//  УчетнаяЗапись	 - СправочникСсылка - Учетная запись для отправки.
//  Группа			 - Строка - Текущая группа. 
//  ID_Пользователя	 - Строка - ИД пользователя.
// 
// Возвращаемое значение:
//  ДокументСсылка.CRM_СообщениеМессенджера - Не связанные сообщения.
//
Функция НеСвязанныеСообщенияКонтакта(УчетнаяЗапись, Группа, ID_Пользователя) Экспорт
	 Запрос = Новый Запрос("ВЫБРАТЬ
	                       |	CRM_СообщениеМессенджера.Ссылка
	                       |ПОМЕСТИТЬ НеСвязанныеСообщения
	                       |ИЗ
	                       |	Документ.CRM_СообщениеМессенджера КАК CRM_СообщениеМессенджера
	                       |ГДЕ
	                       |	CRM_СообщениеМессенджера.ID_Пользователя = &ID_Пользователя
	                       |	И CRM_СообщениеМессенджера.Группа = &Группа
	                       |	И CRM_СообщениеМессенджера.УчетнаяЗапись = &УчетнаяЗапись
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	НеСвязанныеСообщения.Ссылка
	                       |ИЗ
	                       |	НеСвязанныеСообщения КАК НеСвязанныеСообщения
	                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
	                       |		ПО НеСвязанныеСообщения.Ссылка = CRM_ЖурналДокументов.Объект
	                       |			И (CRM_ЖурналДокументов.CRM_Интерес = ЗНАЧЕНИЕ(Документ.CRM_Интерес.ПустаяСсылка))");
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("ID_Пользователя", ID_Пользователя);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

// Текущий пользователь получить право учетной записи.
//
// Параметры:
//  УчетнаяЗапись	 - СправочникСсылка - Ссылка на учетную запись.
//  ИмяПрава		 - Строка - Имя права. 
// 
// Возвращаемое значение:
//  Булево - Право учетной записи.
//
Функция ТекущийПользовательПолучитьПравоУчетнойЗаписи(УчетнаяЗапись, ИмяПрава) Экспорт
	
	ЗначениеПраваУчетнойЗаписи = Ложь;
	
	// Полноправным пользователям разрешены все действия независимо от настроек.
	Если ИмяПрава = "Администрирование" Тогда
		
		ЗначениеПраваУчетнойЗаписи = Пользователи.ЭтоПолноправныйПользователь()
	
	КонецЕсли; 
	
	Если НЕ ЗначениеПраваУчетнойЗаписи Тогда
		
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		
		Если ТипЗнч(ТекущийПользователь) = Тип("СправочникСсылка.Пользователи") Тогда
			Запрос = Новый Запрос;
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	CRM_УчетныеЗаписиМессенджеров.Администрирование,
			               |	CRM_УчетныеЗаписиМессенджеров.Запись
			               |ИЗ
			               |	РегистрСведений.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
			               |ГДЕ
			               |	CRM_УчетныеЗаписиМессенджеров.УчетнаяЗапись = &УчетнаяЗапись
			               |	И CRM_УчетныеЗаписиМессенджеров.Пользователь В (&Пользователь)";
			
			Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
			РолиПользователя = CRM_БизнесПроцессыСервер.ПолучитьРолиПоПользователю(ТекущийПользователь);
			РолиПользователя.Добавить(ТекущийПользователь);
			Запрос.УстановитьПараметр("Пользователь", РолиПользователя);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				ЗначениеПраваУчетнойЗаписи = Выборка[ИмяПрава];
				
			КонецЕсли;
			
		КонецЕсли;		
	
	КонецЕсли; 
	
	Возврат ЗначениеПраваУчетнойЗаписи;

КонецФункции // ПолучитьПравоПользователяУчетнойЗаписи() 

// Пометить исходящие как прочтенные
//
// Параметры:
//  УчетнаяЗапись	 - СправочникСсылка - Учетная запись для отправки.
//  Группа			 - Строка - Текущая группа. 
//  ID_Пользователя	 - Строка - ИД пользователя.
//
Процедура ПометитьИсходящиеКакПрочтенные(УчетнаяЗапись, Группа, ID_Пользователя) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СообщениеМессенджера.Ссылка
	                      |ИЗ
	                      |	Документ.CRM_СообщениеМессенджера КАК CRM_СообщениеМессенджера
	                      |ГДЕ
	                      |	CRM_СообщениеМессенджера.ID_Пользователя = &ID_Пользователя
	                      |	И CRM_СообщениеМессенджера.УчетнаяЗапись = &УчетнаяЗапись
	                      |	И CRM_СообщениеМессенджера.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСообщенияМессенджера.Исходящее)
	                      |	И CRM_СообщениеМессенджера.Группа = &Группа");
	Запрос.УстановитьПараметр("ID_Пользователя", ID_Пользователя);
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Запрос.УстановитьПараметр("Группа", Группа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СообщениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СообщениеОбъект.Прочитано = Истина;
		СообщениеОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

// Процедура - Пометить входящие как прочтенные
//
// Параметры:
//  УчетнаяЗапись	 - СправочникСсылка - Ссылка на учетную запись.
//  Группа			 - Строка - Текущая группа. 
//  ID_Пользователя	 - Строка - ИД пользователя.
//
Процедура ПометитьВходящиеКакПрочтенные(УчетнаяЗапись, Группа, ID_Пользователя) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СообщениеМессенджера.Ссылка
	                      |ИЗ
	                      |	Документ.CRM_СообщениеМессенджера КАК CRM_СообщениеМессенджера
	                      |ГДЕ
	                      |	CRM_СообщениеМессенджера.ID_Пользователя = &ID_Пользователя
	                      |	И CRM_СообщениеМессенджера.УчетнаяЗапись = &УчетнаяЗапись
	                      |	И CRM_СообщениеМессенджера.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСообщенияМессенджера.Входящее)
	                      |	И CRM_СообщениеМессенджера.Группа = &Группа
	                      |	И НЕ CRM_СообщениеМессенджера.Прочитано");
	Запрос.УстановитьПараметр("ID_Пользователя", ID_Пользователя);
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Запрос.УстановитьПараметр("Группа", Группа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СообщениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СообщениеОбъект.Прочитано = Истина;
		СообщениеОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

// Процедура - Записать событие мессенджера
//
// Параметры:
//  Событие			 - ПеречислениеСсылка.CRM_СобытияМессенджеров - Событие мессенджера.
//  УчетнаяЗапись	 - СправочникСсылка - Ссылка на учетную запись.
//  ID_Пользователя	 - Строка - ИД пользователя.
//  Значение		 - ДокументСсылка.CRM_СообщениеМессенджера - Ссылка на документ. 
//
Процедура ЗаписатьСобытиеМессенджера(Событие, УчетнаяЗапись, ID_Пользователя, Значение=Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	CRM_УчетныеЗаписиМессенджеров.Пользователь КАК Пользователь
			               |ИЗ
			               |	РегистрСведений.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
			               |ГДЕ
			               |	CRM_УчетныеЗаписиМессенджеров.УчетнаяЗапись = &УчетнаяЗапись
			               |	И CRM_УчетныеЗаписиМессенджеров.Пользователь ССЫЛКА Справочник.Пользователи
			               |
			               |ОБЪЕДИНИТЬ
			               |
			               |ВЫБРАТЬ
			               |	ИсполнителиЗадач.Исполнитель
			               |ИЗ
			               |	РегистрСведений.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
			               |		ПО CRM_УчетныеЗаписиМессенджеров.Пользователь = ИсполнителиЗадач.РольИсполнителя
			               |ГДЕ
			               |	CRM_УчетныеЗаписиМессенджеров.УчетнаяЗапись = &УчетнаяЗапись");
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.CRM_СобытияМессенджеров.СоздатьМенеджерЗаписи();
		Запись.Пользователь = Выборка.Пользователь;
		Запись.Событие = Событие;
		Запись.УчетнаяЗапись = УчетнаяЗапись;
		Запись.ID_Пользователя = ID_Пользователя;
		Запись.Значение = Значение;
		Запись.Записать(Истина);
	КонецЦикла;
КонецПроцедуры

// Получить события мессенджера
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Ссылка на пользователя.
// 
// Возвращаемое значение:
//  Структура - Структура события.
//
Функция ПолучитьСобытияМессенджера(Пользователь) Экспорт
	НаборЗаписей = РегистрыСведений.CRM_СобытияМессенджеров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	
	События = Новый Массив;
	
	Для каждого Запись из НаборЗаписей Цикл
		Событие = Новый Структура("Событие, УчетнаяЗапись, ID_Пользователя, Значение", Неопределено, Неопределено, Неопределено, Неопределено);
		ЗаполнитьЗначенияСвойств(Событие, Запись);
		События.Добавить(Событие);
	КонецЦикла;
	
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	Возврат События;
КонецФункции

// Очистить события мессенджера.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Ссылка на пользователя.
//
Процедура ОчиститьСобытияМессенджера(Пользователь) Экспорт
	НаборЗаписей = РегистрыСведений.CRM_СобытияМессенджеров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Записать();
КонецПроцедуры

// Связать все сообщения пользователя с контактом
//
// Параметры:
//  ТипМессенджера	 - Строка - Тип мессенджера.
//  ID_Пользователя	 - Строка - ИД пользователя.
//  Контакт			 - ОпределяемыйТип.КонтактВзаимодействия - Контакт взаимодействия.
//
Процедура СвязатьВсеСообщенияПользователяСКонтактом(ТипМессенджера, ID_Пользователя, Контакт) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СообщениеМессенджера.Ссылка
	                      |ИЗ
	                      |	Документ.CRM_СообщениеМессенджера КАК CRM_СообщениеМессенджера
	                      |ГДЕ
	                      |	CRM_СообщениеМессенджера.ID_Пользователя = &ID_Пользователя
	                      |	И CRM_СообщениеМессенджера.УчетнаяЗапись.ТипМессенджера = &ТипМессенджера");
	Запрос.УстановитьПараметр("ID_Пользователя", ID_Пользователя);
	Запрос.УстановитьПараметр("ТипМессенджера", ТипМессенджера);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СообщениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СообщениеОбъект.Контакт = Контакт;
		СообщениеОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Создать сообщения из полученных данных
//
// Параметры:
//  УчетнаяЗапись	 - СправочникСсылка - Ссылка на учетную запись.
//  МассивСообщений	 - Массив - Массив сообщений. 
//
Процедура СоздатьСообщенияИзПолученныхДанных(УчетнаяЗапись, МассивСообщений) Экспорт
	Для каждого ТекСообщение из МассивСообщений Цикл
		СообщениеСсылка = НайтиСообщениеМессенджера(УчетнаяЗапись, ТекСообщение.Группа, ТекСообщение.ID_Пользователя, ТекСообщение.ID_Сообщения);
		Если СообщениеСсылка = Неопределено Тогда 
			Сообщение = Документы.CRM_СообщениеМессенджера.СоздатьДокумент();
			Если ТекСообщение.Свойство("Ссылка") Тогда
				Сообщение.УстановитьСсылкуНового(ТекСообщение.Ссылка);
			КонецЕсли;
			Сообщение.УчетнаяЗапись = УчетнаяЗапись;
			Сообщение.Ответственный = УчетнаяЗапись.Ответственный;
			Сообщение.CRM_РольОтветственного = УчетнаяЗапись.CRM_РольОтветственного;
		Иначе
			Сообщение = СообщениеСсылка.ПолучитьОбъект();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Сообщение, ТекСообщение);
		Сообщение.ВидСообщения = Перечисления.CRM_ВидыСообщенияМессенджера[ТекСообщение.ВидСообщения];
		CRM_РаботаСМессенджерамиСервер.СкрытьИзАрмаПредыдущиеСообщения(Сообщение);
		Сообщение.Записать();
		Для каждого Вложение из ТекСообщение.Вложения Цикл
			Вложение.ВладелецФайлов = Сообщение.Ссылка;
			РаботаСФайлами.ДобавитьФайл(Вложение, Вложение.АдресФайлаВХранилище);
		КонецЦикла;
		CRM_РаботаСМессенджерамиСервер.ЗаписатьСобытиеМессенджера(Перечисления.CRM_СобытияМессенджеров.ПолученоНовоеСообщение, УчетнаяЗапись, Сообщение.ID_Пользователя, Сообщение.Ссылка);
	КонецЦикла;
КонецПроцедуры

// Получить список мессенджеров
// 
// Возвращаемое значение:
//  СписокЗначений - Список мессенджеров.
//
Функция ПолучитьСписокМессенджеров() Экспорт
	СписокМессенджеров = Новый СписокЗначений;
	Для каждого Обработка Из Метаданные.Обработки Цикл
		Если СтрНайти(Обработка.Имя, "CRM_РаботаСМессенджером") = 1 Тогда
			СписокМессенджеров.Добавить(СтрЗаменить(Обработка.Имя, "CRM_РаботаСМессенджером", ""));
		КонецЕсли;
	КонецЦикла;
	Возврат СписокМессенджеров;
КонецФункции

// Структура сообщения месенджера
// 
// Возвращаемое значение:
//  Структура - Структура сообщения. 
//
Функция СтруктураСообщенияМесенджера() Экспорт
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("Дата");
	СтруктураСообщения.Вставить("ID_Сообщения");
	СтруктураСообщения.Вставить("ТекстСообщения");
	СтруктураСообщения.Вставить("ВидСообщения");
	СтруктураСообщения.Вставить("ID_Пользователя");
	СтруктураСообщения.Вставить("Контакт");
	СтруктураСообщения.Вставить("КонтактПредставление");
	СтруктураСообщения.Вставить("Группа");
	СтруктураСообщения.Вставить("Прочитано");
	СтруктураСообщения.Вставить("Вложения", Новый Массив);
	Возврат СтруктураСообщения;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиСообщениеМессенджера(УчетнаяЗапись, Группа, ID_Пользователя, ID_Сообщения) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СообщениеМессенджера.Ссылка
	                      |ИЗ
	                      |	Документ.CRM_СообщениеМессенджера КАК CRM_СообщениеМессенджера
	                      |ГДЕ
	                      |	CRM_СообщениеМессенджера.ID_Пользователя = &ID_Пользователя
	                      |	И CRM_СообщениеМессенджера.УчетнаяЗапись = &УчетнаяЗапись
	                      |	И CRM_СообщениеМессенджера.Группа = &Группа
	                      |	И CRM_СообщениеМессенджера.ID_Сообщения = &ID_Сообщения");
	Запрос.УстановитьПараметр("ID_Сообщения", ID_Сообщения);
	Запрос.УстановитьПараметр("ID_Пользователя", ID_Пользователя);
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Запрос.УстановитьПараметр("Группа", Группа);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
КонецФункции

Процедура СкрытьИзАрмаПредыдущиеСообщения(Сообщение) Экспорт 
	 Запрос = Новый Запрос("ВЫБРАТЬ
	                       |	CRM_СообщениеМессенджера.Ссылка КАК Ссылка
	                       |ИЗ
	                       |	Документ.CRM_СообщениеМессенджера КАК CRM_СообщениеМессенджера
	                       |ГДЕ
	                       |	CRM_СообщениеМессенджера.ID_Пользователя = &ID_Пользователя
	                       |	И CRM_СообщениеМессенджера.Группа = &Группа
	                       |	И CRM_СообщениеМессенджера.УчетнаяЗапись = &УчетнаяЗапись
						   //|	И CRM_СообщениеМессенджера.Дата < &Дата
	                       |	И НЕ CRM_СообщениеМессенджера.CRM_СкрытьВАРМ
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	CRM_СообщениеМессенджера.Дата УБЫВ");
	Запрос.УстановитьПараметр("УчетнаяЗапись", Сообщение.УчетнаяЗапись);
	Запрос.УстановитьПараметр("Группа", Сообщение.Группа);
	Запрос.УстановитьПараметр("ID_Пользователя", Сообщение.ID_Пользователя);
//	Запрос.УстановитьПараметр("Дата", Сообщение.Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Первый = Истина;
	Пока Выборка.Следующий() Цикл
		Если Первый Тогда
			Первый = Ложь;
			Продолжить;
		КонецЕсли;
		РегистрыСведений.CRM_СостоянияЛидов.УдалитьСостояниеЛида(Выборка.Ссылка);
		СообщениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СообщениеОбъект.CRM_СкрытьВАРМ = Истина;
		Попытка
			СообщениеОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ОжиданиеСобытийМессенджера(УникальныйИдентификаторЗадания = Неопределено, ТипМессенджера = Неопределено) Экспорт
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() И Не ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	Если УникальныйИдентификаторЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	ЭтоФайловаяБаза = ОбщегоНазначения.ИнформационнаяБазаФайловая(СтрокаСоединения);
	
	МодульМенеджера = CRM_РаботаСМессенджерамиСерверПовтИсп.МенеджерМессенджера(ТипМессенджера);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	CRM_УчетныеЗаписиМессенджеров.Ссылка
	|ИЗ
	|	Справочник.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
	|ГДЕ
	|	CRM_УчетныеЗаписиМессенджеров.УникальныйИдентификаторЗадания = &УникальныйИдентификаторЗадания
	|	И CRM_УчетныеЗаписиМессенджеров.ТипМессенджера = &ТипМессенджера");
	Запрос.УстановитьПараметр("УникальныйИдентификаторЗадания", УникальныйИдентификаторЗадания);
	Запрос.УстановитьПараметр("ТипМессенджера", ТипМессенджера);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		МассивСообщений = МодульМенеджера.ПолучитьСообщения(Выборка.Ссылка);
		СоздатьСообщенияИзПолученныхДанных(Выборка.Ссылка, МассивСообщений);
		Если ЭтоФайловаяБаза ИЛИ РаботаВМоделиСервисаПовтИсп.РазделениеВключено() Тогда Возврат; КонецЕсли;
		МодульМенеджера.ОжиданиеСобытий(Выборка.Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
